// 每一边的长度
const cellNum = 8;

// 颜色
// const colorList = ["#91d5ff", "#69c0ff", "#40a9ff", "#1890ff", "#096dd9", "#0050b3", "#003a8c", "#002766"];
const colorList = ["#f0f0f0", "#d9d9d9", "#bfbfbf", "#595959"];

// 颜色总数
const colorNum = colorList.length;

// 第一关
const round1 = [
  [0, 0, 0, 3, 0, 0, 0, 0],
  [0, 0, 3, 0, 0, 0, 0, 0],
  [0, 3, 3, 3, 0, 0, 0, 0],
  [3, 3, 3, 3, 0, 0, 0, 0],
  [0, 0, 0, 0, 3, 3, 3, 0],
  [0, 0, 0, 0, 3, 3, 3, 0],
  [0, 0, 0, 0, 0, 0, 3, 0],
  [0, 0, 0, 0, 0, 0, 0, 3],
];
const check1 = [
  {
    coordinate: [6,2],
    value: 3,
  }
]

// 第二关
const round2 = [
  [0, 0, 0, 0, 0, 0, 0, 0],
  [0, 0, 2, 0, 0, 0, 0, 0],
  [0, 0, 2, 3, 0, 0, 2, 3],
  [0, 0, 3, 0, 0, 0, 3, 0],
  [0, 0, 0, 3, 0, 0, 0, 0],
  [0, 0, 0, 0, 0, 0, 0, 0],
  [3, 2, 0, 0, 3, 0, 0, 0],
  [0, 0, 3, 0, 0, 0, 3, 0],
];
const check2 = [
  {
    coordinate: [0, 5],
    value: 3,
  }
];

// 第三关
const round3 = [
  [0, 0, 0, 4, 3, 0, 0, 0],
  [0, 0, 4, 0, 0, 3, 0, 0],
  [0, 4, 0, 0, 0, 0, 3, 0],
  [4, 0, 0, 0, 0, 0, 3, 0],
  [4, 2, 2, 2, 3, 3, 0, 0],
  [0, 4, 2, 2, 3, 3, 0, 0],
  [0, 0, 4, 2, 3, 0, 0, 0],
  [0, 0, 0, 4, 0, 0, 0, 0],
];
const check3 = [
  {
    coordinate: [5, 6],
    value: 3,
  }
]

// 第四关
const round4 = [
  [0, 0, 0, 0, 0, 0, 0, 3],
  [0, 0, 0, 3, 0, 0, 0, 0],
  [3, 0, 0, 0, 0, 3, 0, 0],
  [0, 3, 0, 3, 0, 0, 0, 0],
  [3, 0, 3, 0, 3, 0, 0, 0],
  [0, 0, 0, 3, 0, 0, 0, 0],
  [3, 0, 0, 0, 0, 0, 3, 0],
  [0, 0, 0, 3, 0, 0, 0, 0],
];
const check4 = [
  {
    coordinate: [5, 5],
    value: 3,
  }
]

const rounds = [round1, round2, round3, round4,];
const checks = [check1, check2, check3, check4,];

// roundlearn
const roundlearn = [
  [0, 1, 2, 3, 4],
  [1, 2, 3, 4, 1],
  [2, 3, 4, 1, 2],
  [3, 4, 1, 2, 3],
  [4, 1, 2, 3, 1],
];


// export default {
//   cellNum,
//   colorList,
//   colorNum,
//   rounds,
//   checks,
// }
